// Написать пррограмму, которая на вход принимает число и выдает его квадрат (умножение само на себя).

int number = int.Parse(Console.ReadLine());

int quarter = number * number;

Console.WriteLine(quarter);